# Information Systems for Engineers 2020 - Cheat Sheet

During the exam, you will be required to write SQL queries using a Jupyter notebook.

This notebook is designed to help you start writing your queries by providing you an environment with the datasets loaded and a simple query that you can use to recap the syntax of SQL.

Feel free to extend this notebook and use it for preparing the answers you need for the exam. Take into account that the content of this notebook will not be considered for grading.

## SQL

There is a local PostgreSQL 12 installation with a dataset loaded into a database. Run the next cell to connect to it.

In [1]:
%load_ext sql
%sql  postgresql://postgres:example@db

To print the tables currently loaded in the database run:

In [2]:
%%sql

SELECT * 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_TYPE = 'BASE TABLE' and TABLE_CATALOG = 'postgres' and TABLE_SCHEMA = 'public'
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('postgres', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'nwemployees', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'employeeterritories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

To print the attributes of a particular table (`stations`, for example) run:

In [3]:
%%sql

SELECT column_name, data_type, character_maximum_length
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name = 'stations'
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('num_platforms', 'integer', None),
 ('avg_weekday_passengers', 'integer', None),
 ('avg_weekend_passengers', 'integer', None),
 ('id', 'character varying', 10)]

## Complex query example

A more complex PostgreSQL query would look like:

In [4]:
%%sql

SELECT id, name, service, open_mon, avg_weekday_passengers FROM (
    stations JOIN station_services 
    ON stations.id=station_services.station_id 
    AND station_services.open_mon=True
) as monday_services 
    GROUP BY id, name, service, open_mon, avg_weekday_passengers 
    HAVING service='Western Union' AND avg_weekday_passengers < 10000
    ORDER BY avg_weekday_passengers ASC;

 * postgresql://postgres:***@db
6 rows affected.

[('BRU', 'Brunnen', 'Western Union', True, 3000),
 ('SCHW', 'Schwyz', 'Western Union', True, 3200),
 ('EBR', 'Emmenbrucke', 'Western Union', True, 5600),
 ('OWT', 'Oberwinterthur', 'Western Union', True, 5700),
 ('CHAM', 'Cham', 'Western Union', True, 6800),
 ('UZ', 'Uznach', 'Western Union', True, 8600)]

## Exam database − semi-realistic train travel data around Zürich

The dataset represents stations, train routes, train trips and customer's trips on the SBB around Zürich. Some of the station and timetable data is real, some is synthetic, as is all the customer trip data.

Here is some basic information on the database tables.

### `stations` table

Information on the train stations in the network around Zürich.

`name` is the name of the station

`num_platforms` is the number of platforms in the station

`avg_weekday_passengers` is the average number of daily passengers on a weekday

`avg_weekend_passengers` is the average number of daily passengers on a weekend day

In [5]:
%%sql
SELECT * FROM stations LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('BG', 'Brugg AG', 3, 24500, 11700, 'SBB'),
 ('SS', 'Sursee', 2, 13900, 8100, 'SBB'),
 ('SEM', 'Sempach-Neuenkirch', 2, 2500, 1400, 'SBB'),
 ('EBR', 'Emmenbrucke', 2, 5600, 3200, 'SBB')]

### `station_services` table

Contains the services offered by the stations in the network, and their opening days.

`station_id` is the station id as defined in the `stations` table

`service` is the description of the service

`open_mon` represents whether the service is open on monday

`open_tue` represents whether the service is open on tueday

`open_wed` represents whether the service is open on wednesday

`open_thu` represents whether the service is open on thursday

`open_fri` represents whether the service is open on friday

`open_sat` represents whether the service is open on saturday

`open_sun` represents whether the service is open on sunday

In [6]:
%%sql
SELECT * FROM station_services LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('BAA', 'Geldwechsel', True, True, True, True, True, True, False),
 ('BAA', 'Gepaeck', True, True, True, True, True, True, False),
 ('BAA', 'Gepaeckaufbewahrung', True, True, True, True, True, True, False),
 ('BAA', 'Western Union', True, True, True, True, True, True, False)]

### `train_routes` table

A train route is a fixed path and train configuration. There are multiple trips on the same route within a day.

`route_kind` is the kind of route, e.g. 'InterRegio'

`bikes_permitted` represents whether bikes are permitted on this route

`carriages` is the number of carriages in this train configuration

In [7]:
%%sql
SELECT * FROM train_routes LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('11-3-j20-1', 'Intercity', True, 3),
 ('1-16-j20-1', 'InterRegio', True, 6),
 ('1-1-A-j20-1', 'Intercity', False, 10),
 ('12-21-j20-1', 'Intercity', False, 2)]

### `train_trips` table

A train trip is a single one-way trip of a train on a route.

`route_id` is the corresponding train_route (in the `train_routes` table)

`headsign` is the headsign on the train for this trip

`occupancy_1st_class` is the estimate of occupancy in 1st class, as an integer between 1 and 3 (inclusive)

`occupancy_2nd_class` is the estimate of occupancy in 2nd class, as an integer between 1 and 3 (inclusive)

In [8]:
%%sql
SELECT * FROM train_trips LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('1.TA.11-3-j20-1.1.R', '11-3-j20-1', 'Chur', 1, 3),
 ('10.TA.11-3-j20-1.1.R', '11-3-j20-1', 'Chur', 2, 2),
 ('100.TA.11-3-j20-1.30.R', '11-3-j20-1', 'Chur', 1, 1),
 ('101.TA.11-3-j20-1.34.R', '11-3-j20-1', 'Chur', 2, 1)]

### `customer_trips` table

`trip_id` is the train trip (in table `train_trips`) corresponding to this customer trip

`board_station_id` is the id of the station where the passenger boarded the train

`board_time` is the time and date when the passenger boarded the train

`alight_station_id` is the id of the station where the passenger alighted the train

`alight_time` is the time and date when the passenger alighted the train

`stops` is the number of stops encompassed by the customer's trip

`ticket_kind` is the kind of ticket used for this trip, e.g. 'Day'

`duration_mins` is the duration of the customer's trip in minutes

Contains the services offered by the stations in the network.

In [9]:
%%sql
SELECT * FROM customer_trips LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(1, '1.TA.1-16-j20-1.1.R', 'BD', datetime.datetime(2019, 3, 12, 5, 38), 'ZUE', datetime.datetime(2019, 3, 12, 5, 54), 1, 'Single', 17),
 (2, '1.TA.1-36-j20-1.1.H', 'BD', datetime.datetime(2019, 3, 12, 5, 52), 'BG', datetime.datetime(2019, 3, 12, 6, 0), 1, 'GA', 9),
 (3, '1.TA.12-21-j20-1.1.H', 'LZ', datetime.datetime(2019, 3, 12, 22, 18), 'FL', datetime.datetime(2019, 3, 12, 23, 22), 2, 'Single', 65),
 (4, '1.TA.12-21-j20-1.1.H', 'GD', datetime.datetime(2019, 3, 12, 23, 5), 'FL', datetime.datetime(2019, 3, 12, 23, 22), 1, 'Day', 18)]

The customer trips represent one operation day, from early morning of March 12th 2019 to late night (early morning of March 13th 2019).

In [10]:
%%sql
SELECT MIN(board_time), MAX(alight_time) FROM customer_trips;

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.datetime(2019, 3, 12, 4, 25), datetime.datetime(2019, 3, 13, 1, 24))]

##### Note: the examples provided above do not contain all the query operations you might need during the exam.

Now its your turn, you can write all your queries in new cells below. Feel free to add as many cells as needed.

---

# Round 1

In [11]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON s.id = ss.station_id

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [12]:
%%sql
SELECT COUNT(*)
FROM station_services
WHERE station_id = 'ZEN'

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [13]:
%%sql
SELECT COUNT(*) AS num_services
FROM station_services
GROUP BY station_id
ORDER BY COUNT(*) DESC
LIMIT 1

 * postgresql://postgres:***@db
1 rows affected.

[(12,)]

In [14]:
%%sql
SELECT COUNT(*)
FROM stations

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [15]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [16]:
%%sql
SELECT COUNT(*)
FROM customer_trips c
JOIN train_trips t
ON t.id = c.trip_id
JOIN train_routes tr
ON tr.id = t.route_id
WHERE bikes_permitted IS TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [17]:
%%sql
SELECT ROUND(AVG(duration_mins), 0)
FROM customer_trips
WHERE board_station_id = 'ZUE' AND alight_station_id IN
    (SELECT id
    FROM stations
    WHERE num_platforms = 2)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [18]:
%%sql
SELECT COUNT(*)
FROM stations s1
CROSS JOIN stations s2
WHERE s1.id != s2.id AND
        s1.id || s2.id NOT IN 
        (SELECT board_station_id || alight_station_id
        FROM customer_trips)

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 2

In [19]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [20]:
%%sql
SELECT COUNT(DISTINCT ss.service)
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
WHERE ss.station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [21]:
%%sql
SELECT ss.station_id, COUNT(DISTINCT ss.service) AS max_services
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
GROUP BY ss.station_id
ORDER BY max_services DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [22]:
%%sql
SELECT COUNT(*)
FROM stations s
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [23]:
%%sql
SELECT avg_weekday_passengers
FROM stations s
ORDER BY avg_weekday_passengers DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [24]:
%%sql
SELECT COUNT(DISTINCT ct.id)
FROM customer_trips ct
JOIN train_trips tt
ON ct.trip_id = tt.id
JOIN train_routes tr
ON tr.id = tt.route_id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [25]:
%%sql
SELECT ROUND(AVG(ct.duration_mins),0) AS avg_trip_time
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id 
WHERE board_station_id = 'ZUE' AND s.num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [26]:
%%sql
SELECT COUNT(*)
FROM stations s1, stations s2
WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN
    (SELECT board_station_id, alight_station_id
    FROM customer_trips)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 3

In [27]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [28]:
%%sql
SELECT COUNT(*)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [29]:
%%sql
SELECT *
FROM station_services
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('BAA', 'Geldwechsel', True, True, True, True, True, True, False),
 ('BAA', 'Gepaeck', True, True, True, True, True, True, False),
 ('BAA', 'Gepaeckaufbewahrung', True, True, True, True, True, True, False),
 ('BAA', 'Western Union', True, True, True, True, True, True, False),
 ('BAA', 'Aufgabezeiten Fluggepaeck nach Zurich Flughafen', True, True, True, True, True, True, False)]

In [30]:
%%sql
SELECT station_id, COUNT(DISTINCT service) AS num_ser
FROM station_services
GROUP BY station_id
ORDER BY num_ser DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [31]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [32]:
%%sql
SELECT avg_weekday_passengers
FROM stations
ORDER BY avg_weekday_passengers DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [33]:
%%sql
SELECT COUNT(DISTINCT ct.id)
FROM train_trips tt
JOIN customer_trips ct
ON ct.trip_id = tt.id
JOIN train_routes tr
ON tt.route_id = tr.id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [34]:
%%sql
SELECT ROUND(AVG(duration_mins), 0)
FROM customer_trips ct
JOIN stations s
ON s.id = ct.alight_station_id
WHERE board_station_id = 'ZUE' AND num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [35]:
%%sql
SELECT COUNT(*)
FROM stations s1
CROSS JOIN stations s2
WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN
                                (SELECT board_station_id, alight_station_id
                                FROM customer_trips)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 4

In [36]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON   ss.station_id = s.id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [37]:
%%sql
SELECT COUNT(*)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [38]:
%%sql
SELECT station_id, COUNT(service) AS num_serv
FROM station_services
GROUP BY station_id
ORDER BY num_serv DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [39]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [40]:
%%sql
SELECT avg_weekday_passengers
FROM stations
ORDER BY avg_weekday_passengers DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [41]:
%%sql
SELECT COUNT(*)
FROM customer_trips ct
JOIN train_trips tt
ON tt.id = ct.trip_id
JOIN train_routes tr
ON tr.id = tt.route_id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [42]:
%%sql
SELECT ROUND(AVG(duration_mins),0)
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id
WHERE board_station_id = 'ZUE' AND num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [43]:
%%sql
SELECT COUNT(*)
FROM stations s1
CROSS JOIN stations s2
WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id FROM customer_trips)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 5

In [44]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [45]:
%%sql
SELECT COUNT(DISTINCT service)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [46]:
%%sql
SELECT station_id, COUNT(DISTINCT service) AS num_ser
FROM station_services
GROUP BY station_id
ORDER BY num_ser DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [47]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [48]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [49]:
%%sql
SELECT COUNT(*)
FROM customer_trips ct
JOIN train_trips tt
ON tt.id = ct.trip_id
JOIN train_routes tr
ON tr.id = tt.route_id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [50]:
%%sql
SELECT ROUND(AVG(duration_mins), 0)
FROM customer_trips ct
JOIN stations s
ON s.id = ct.alight_station_id
WHERE board_station_id = 'ZUE' AND s.num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [51]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT s1.id, s2.id
    FROM stations s1
    CROSS JOIN stations s2
    WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id
                                                    FROM customer_trips))

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 6

In [52]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON ss.station_id = s.id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [53]:
%%sql
SELECT COUNT(DISTINCT service)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [54]:
%%sql
SELECT station_id, COUNT(DISTINCT service) AS tot_ser
FROM station_services
GROUP BY station_id
ORDER BY tot_ser DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [55]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [56]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [57]:
%%sql
SELECT COUNT(DISTINCT ct.id)
FROM customer_trips ct
JOIN train_trips t
ON ct.trip_id = t.id
JOIN train_routes tr
ON t.route_id = tr.id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [58]:
%%sql
SELECT ROUND(AVG(duration_mins), 0)
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id
WHERE ct.board_station_id = 'ZUE' AND s.num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [59]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT s1.id, s2.id
    FROM stations s1
    CROSS JOIN stations s2
    WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id
                                                           FROM customer_trips))

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 7

In [60]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON s.id = ss.station_id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [61]:
%%sql
SELECT COUNT(DISTINCT service)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [62]:
%%sql
SELECT station_id, COUNT(DISTINCT service) AS num_ser
FROM station_services
GROUP BY station_id
ORDER BY num_ser DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [63]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [64]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [65]:
%%sql
SELECT COUNT(DISTINCT ct.id)
FROM customer_trips ct
JOIN train_trips tt
ON ct.trip_id = tt.id
JOIN train_routes tr
ON tr.id = tt.route_id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [66]:
%%sql
SELECT ROUND(AVG(duration_mins),0)
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id
WHERE ct.board_station_id = 'ZUE' AND s.num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [67]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT s1.id, s2.id
    FROM stations s1
    CROSS JOIN stations s2
    WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id
                                                    FROM customer_trips))

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---

# Round 8

In [68]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON s.id = ss.station_id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [69]:
%%sql
SELECT COUNT(DISTINCT service)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [70]:
%%sql
SELECT station_id, COUNT(service) AS count_services
FROM station_services
GROUP BY station_id
ORDER BY count_services DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [71]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [72]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [73]:
%%sql
SELECT COUNT(ct.id)
FROM customer_trips ct
JOIN train_trips tt
ON ct.trip_id = tt.id
JOIN train_routes tr
ON tt.route_id = tr.id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [74]:
%%sql
SELECT ROUND(AVG(duration_mins),0)
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id
WHERE board_station_id = 'ZUE' AND s.num_platforms = 2
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [75]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT s1.id, s2.id
    FROM stations s1
    CROSS JOIN stations s2
    WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id
                                                    FROM customer_trips));

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

In [76]:
%%sql
SELECT board_station_id, alight_station_id
FROM customer_trips
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[('BD', 'ZUE'),
 ('BD', 'BG'),
 ('LZ', 'FL'),
 ('GD', 'FL'),
 ('GD', 'FL'),
 ('GD', 'FL'),
 ('GD', 'FL'),
 ('LZ', 'GD'),
 ('LZ', 'GD'),
 ('EBI', 'TW')]

---

# Round 9

In [78]:
%%sql
SELECT COUNT(*)
FROM station_services ss
JOIN stations s
ON s.id = ss.station_id
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(198,)]

In [82]:
%%sql
SELECT COUNT(DISTINCT service)
FROM station_services
WHERE station_id = 'ZEN'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [86]:
%%sql
SELECT station_id, COUNT(DISTINCT service) AS num_ser
FROM station_services
GROUP BY station_id
ORDER BY num_ser DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('LZ', 12)]

In [87]:
%%sql
SELECT COUNT(*)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(41,)]

In [92]:
%%sql
SELECT MAX(avg_weekday_passengers)
FROM stations
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(471300,)]

In [100]:
%%sql
SELECT COUNT(ct.id)
FROM customer_trips ct
JOIN train_trips tt
ON ct.trip_id = tt.id
JOIN train_routes tr
ON tt.route_id = tr.id
WHERE bikes_permitted = TRUE
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77150,)]

In [110]:
%%sql
SELECT ROUND(AVG(duration_mins), 0)
FROM customer_trips ct
JOIN stations s
ON ct.alight_station_id = s.id
WHERE num_platforms = 2 AND ct.board_station_id = 'ZUE'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('21'),)]

In [119]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT s1.id, s2.id
    FROM stations s1
    CROSS JOIN stations s2
    WHERE s1.id != s2.id AND (s1.id, s2.id) NOT IN (SELECT board_station_id, alight_station_id FROM customer_trips))

 * postgresql://postgres:***@db
1 rows affected.

[(1304,)]

---